## Plan Result (instant-sync-events-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11509451653)



<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.eventtracker_lambda_2D56166D



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.eventtracker_lambda_2D56166D will be updated in-place
  ~ resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "InstantSyncEvents-Prod-EventTracker-Function"
      ~ layers                         = [
          ~ "arn:aws:lambda:us-east-1:177933569100:layer:AWS-Parameters-and-Secrets-Lambda-Extension:11" -> "arn:aws:lambda:us-east-1:177933569100:layer:AWS-Parameters-and-Secrets-Lambda-Extension:12",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:InstantSyncEvents-Prod-EventTracker-Function:248" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:InstantSyncEvents-Prod-EventTracker-Function:248/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "pocket"
            "component_code" = "pocket-instantsyncevents"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "InstantSyncEvents"
        }
      ~ timeout                        = 900 -> 300
      ~ version                        = "248" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":889,"Program":"tfcmt","SHA1":"792dd15a90e3b36463827f5c4393c2b3ca49e283","Target":"instant-sync-events-cdk-production","Vars":{},"WorkflowName":"Instant Sync Events"} -->